app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE (vote_count >= 10 OR collection_count >= 10 OR comment_count >= 10) ORDER BY id DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE (vote_count >= 10 OR collection_count >= 10 OR comment_count >= 10)
---
  def index
    @posts = Post.send((params[:filter] || :latest).to_sym).page params[:page]