app/controllers/user_test2s_controller.rb

  def index
    @user_test2s = UserTest2.all
---
SELECT "user_test2s".* FROM "user_test2s"